Revit 2027 API
BuiltInFailures.OverlapFailures.AreaBoundaryLinesOverlap Property
 Highlighted area boundary lines overlap. Color fills, area tags, and areas may not behave correctly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AreaBoundaryLinesOverlap { get; }
Public Shared ReadOnly Property AreaBoundaryLinesOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AreaBoundaryLinesOverlap {
	FailureDefinitionId^ get ();
}
static member AreaBoundaryLinesOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace